In [1]:
import pandas as pd
import numpy as np
import seaborn as sns
import scipy as sp
import sklearn
import matplotlib.pyplot as plt

# Step - 4: Set for feature enginering

Let's take a set with only selected features

In [2]:
feature_set=pd.read_csv(r'C:\Users\NSharma\Documents\datascience\HousingProject\dataset\feature_train_set')

In [3]:
df=feature_set.copy()

In [4]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16512 entries, 0 to 16511
Data columns (total 6 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   Unnamed: 0               16512 non-null  int64
 1   longitude                16512 non-null  float64
 2   latitude                 16512 non-null  float64
 3   median_income            16512 non-null  float64
 4   ocean_proximity          16512 non-null  object
 5   total_bedrooms_per_room  16512 non-null  float64
dtypes: float64(4), int64(1), object(1)
memory usage: 774.1+ KB

In [5]:
df.drop('Unnamed: 0',axis=1,inplace = True)

In [6]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16512 entries, 0 to 16511
Data columns (total 5 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   longitude                16512 non-null  float64
 1   latitude                 16512 non-null  float64
 2   median_income            16512 non-null  float64
 3   ocean_proximity          16512 non-null  object
 4   total_bedrooms_per_room  16512 non-null  float64
dtypes: float64(4), object(1)
memory usage: 645.1+ KB

# Step-5: Encode categoerical variables

Let's encode for regression

In [7]:
df['ocean_proximity'].value_counts()

ocean_proximity
<1H OCEAN     7313
INLAND        5276
NEAR OCEAN    2091
NEAR BAY      1827
ISLAND           5
Name: count, dtype: int64

In [11]:
dummy_variables = pd.get_dummies(df['ocean_proximity'])
dummy_variables.columns
dummy_variables[['<1H OCEAN', 'INLAND', 'ISLAND', 'NEAR BAY', 'NEAR OCEAN']]=dummy_variables[['<1H OCEAN', 'INLAND', 'ISLAND', 'NEAR BAY', 'NEAR OCEAN']].astype('int')

In [12]:
dummy_variables.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16512 entries, 0 to 16511
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   <1H OCEAN   16512 non-null  int32
 1   INLAND      16512 non-null  int32
 2   ISLAND      16512 non-null  int32
 3   NEAR BAY    16512 non-null  int32
 4   NEAR OCEAN  16512 non-null  int32
dtypes: int32(5)
memory usage: 322.6 KB

In [13]:
df=pd.concat([df,dummy_variables],axis=1)

In [14]:
df.head()

,longitude,latitude,median_income,ocean_proximity,total_bedrooms_per_room,<1H OCEAN,INLAND,ISLAND,NEAR BAY,NEAR OCEAN
0,-117.22,32.75,4.5878,NEAR OCEAN,0.185136,0,0,0,0,1
1,-117.03,32.69,4.6648,NEAR OCEAN,0.180910,0,0,0,0,1
2,-122.27,37.74,3.6875,NEAR BAY,0.224924,0,0,0,1,0
3,-121.82,37.25,5.1663,<1H OCEAN,0.157672,1,0,0,0,0
4,-115.98,33.32,1.4688,INLAND,0.191667,0,1,0,0,0

In [15]:
df.drop('ocean_proximity',axis=1,inplace=True)

In [16]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 16512 entries, 0 to 16511
Data columns (total 9 columns):
 #   Column                   Non-Null Count  Dtype
---  ------                   --------------  -----
 0   longitude                16512 non-null  float64
 1   latitude                 16512 non-null  float64
 2   median_income            16512 non-null  float64
 3   total_bedrooms_per_room  16512 non-null  float64
 4   <1H OCEAN                16512 non-null  int32
 5   INLAND                   16512 non-null  int32
 6   ISLAND                   16512 non-null  int32
 7   NEAR BAY                 16512 non-null  int32
 8   NEAR OCEAN               16512 non-null  int32
dtypes: float64(4), int32(5)
memory usage: 838.6 KB

In [17]:
df.head()

,longitude,latitude,median_income,total_bedrooms_per_room,<1H OCEAN,INLAND,ISLAND,NEAR BAY,NEAR OCEAN
0,-117.22,32.75,4.5878,0.185136,0,0,0,0,1
1,-117.03,32.69,4.6648,0.180910,0,0,0,0,1
2,-122.27,37.74,3.6875,0.224924,0,0,0,1,0
3,-121.82,37.25,5.1663,0.157672,1,0,0,0,0
4,-115.98,33.32,1.4688,0.191667,0,1,0,0,0

In [18]:
df.describe()

,longitude,latitude,median_income,total_bedrooms_per_room,<1H OCEAN,INLAND,ISLAND,NEAR BAY,NEAR OCEAN
count,16512.000000,16512.000000,16512.000000,16512.000000,16512.000000,16512.000000,16512.000000,16512.000000,16512.000000
mean,-119.565121,35.631252,3.863585,0.212850,0.442890,0.319525,0.000303,0.110647,0.126635
std,1.999323,2.133670,1.907402,0.060708,0.496743,0.466307,0.017399,0.313704,0.332574
min,-124.350000,32.540000,0.499900,0.027272,0.000000,0.000000,0.000000,0.000000,0.000000
25%,-121.780000,33.940000,2.561150,0.175014,0.000000,0.000000,0.000000,0.000000,0.000000
50%,-118.490000,34.250000,3.524600,0.202845,0.000000,0.000000,0.000000,0.000000,0.000000
75%,-118.010000,37.720000,4.727000,0.240032,1.000000,1.000000,0.000000,0.000000,0.000000
max,-114.310000,41.950000,15.000100,1.818182,1.000000,1.000000,1.000000,1.000000,1.000000

Let's drop ocean and near bay features too as we saw they don't affect target variable much

In [19]:
df.columns

Index(['longitude', 'latitude', 'median_income', 'total_bedrooms_per_room',
       '<1H OCEAN', 'INLAND', 'ISLAND', 'NEAR BAY', 'NEAR OCEAN'],
      dtype='object')

In [20]:
df.drop(['<1H OCEAN', 'NEAR BAY', 'NEAR OCEAN'],axis=1,inplace=True)

In [21]:
df.head()

   longitude  latitude  median_income  total_bedrooms_per_room  INLAND  ISLAND
0    -117.22     32.75         4.5878                 0.185136       0       0
1    -117.03     32.69         4.6648                 0.180910       0       0
2    -122.27     37.74         3.6875                 0.224924       0       0
3    -121.82     37.25         5.1663                 0.157672       0       0
4    -115.98     33.32         1.4688                 0.191667       1       0

In [23]:
df.columns

Index(['longitude', 'latitude', 'median_income', 'total_bedrooms_per_room',
       'INLAND', 'ISLAND'],
      dtype='object')

# Step-6: Normalize

Let's normalize using standard scalar

In [26]:
for col in df.columns.to_list():
    df[col]=(df[col]-df[col].mean())/df[col].std()

In [27]:
df.head()

,longitude,latitude,median_income,total_bedrooms_per_room,INLAND,ISLAND
0,1.172958,-1.350374,0.379686,-0.456507,-0.685225,-0.017404
1,1.267990,-1.378495,0.420056,-0.526113,-0.685225,-0.017404
2,-1.352898,0.988319,-0.092317,0.198892,-0.685225,-0.017404
3,-1.127822,0.758668,0.682979,-0.908892,-0.685225,-0.017404
4,1.793168,-1.083229,-1.255522,-0.348929,1.459286,-0.017404